import React from "react";

export default function AboutPage() {
  return (
    <>
      <section>
        <div className="max-w-6xl mx-auto px-4 text-gray-700">
          <div className="pt-10 md:pt-20">
            <h3 className="text-center">Основні досягнення</h3>
            <ul className="pl-5 space-y-2 mt-4">
              <li>
                <h4 className="font-semibold">Письменник:</h4>
                <ul className="list-disc pl-5 mt-2">
                  <li>35 років досвіду</li>
                  <li>17 книжок (українською, англійською, російською)</li>
                  <li>150 000+ примірників</li>
                </ul>
              </li>
              <li>
                <h4 className="font-semibold">Рекламіст і маркетолог:</h4>
                <ul className="list-disc pl-5 mt-2">
                  <li>30 років досвіду</li>
                  <li>Креативний директор трьох мережевих агенцій</li>
                  <li>
                    Десятки рекламних кампаній для української та
                    загальноєвропейської аудиторій
                  </li>
                  <li>
                    Маркетингові стратегії для великих національних бізнесів
                  </li>
                </ul>
              </li>
              <li>
                <h4 className="font-semibold">Сценарист:</h4>
                <ul className="list-disc pl-5 mt-2">
                  <li>25 років досвіду</li>
                  <li>10 сценаріїв ТВ-фільмів та серіалів</li>
                  <li>Багатомільйонні аудиторії</li>
                </ul>
              </li>
              <li>
                <h4 className="font-semibold">Стратегічний аналітик:</h4>
                <ul className="list-disc pl-5 mt-2">
                  <li>15 років досвіду</li>
                  <li>Власна методологія «5 Принципів Ефективності»</li>
                  <li>Низка точних передбачень</li>
                </ul>
              </li>
              <li>Мислитель, який розуміє закони, що рухають нашим світом.</li>
              <li>
                Сторітеллер, який захопливо розповість вам про те, як усе
                працює.
              </li>
              <li>Велика душа, яка щиро прагне змінити цей світ на краще.</li>
            </ul>
          </div>
        </div>
      </section>
      <section>
        <div className="max-w-6xl mx-auto px-4 text-gray-700">
          <div className="py-5 md:py-10">
            <h3 className="text-center">Фаховий досвід</h3>
            <h4 className=""> Незалежні креативні та розробницькі проєкти:</h4>

            <ul className="list-disc pl-5 mb-4">
              <li>
                <p>
                  <span className="underline font-semibold">
                    Game Writer | Roguelike Deckbuilder Game (2024 – Present)
                  </span>
                  <br />
                  <span>
                    Розробка глибоких, захоплюючих оповідей для стратегічної
                    інді-гри. Створення сюжетних ліній, арок персонажів і
                    цілісного світу гри.
                  </span>
                </p>
              </li>
              <li>
                <p>
                  <span className="underline">
                    Game Writer | Strategy Card Game (2024 – Present)
                  </span>
                  <br />
                  <span>
                    Розробка концепції, змісту гри та її ігрової механіки.
                  </span>
                </p>
              </li>
              <li>
                <p>
                  <span className="underline ">
                    Lead Writer & Designer | Live History Adventure (Tourism
                    App: Story + Quest + Audio Drama) (2024 – Present)
                  </span>
                  <br />
                  <span>
                    Розробка та написання сюжетів, квестів і інтерактивних
                    елементів. Інтеграція аудіорозповіді з гейміфікованими
                    екскурсіями містом.
                  </span>
                </p>
              </li>
              <li>
                <p>
                  <span className="underline ">
                    Freelance Content Creator (Books, YouTube Scripts, Articles)
                    (2023 – Present)
                  </span>
                  <br />
                  <span>
                    Гострайтинг книг і сценаріїв для міжнародних клієнтів.
                    Створення захопливих оповідей на різних платформах.
                  </span>
                </p>
              </li>
              <li>
                <p>
                  <span className="underline ">
                    Author and Publisher (Historical & Storytelling Books) (2019
                    – 2023)
                  </span>
                  <br />
                  <span>
                    Видав 3 книги. Досліджував роль сторітелінгу у світовій
                    історії та культурі.
                  </span>
                </p>
              </li>
            </ul>

            <h4>Галузевий досвід (креативне лідерство та сторітеллінг):</h4>
            <ul className="list-disc pl-5">
              <li>
                <p>
                  <span className="underline font-semibold">
                    Creative Lead & Strategist | Manava Crypto (2022 – 2023)
                  </span>
                  <br />
                  <span>Розробив ідеологічну концепцію Manava Multiverse.</span>
                </p>
              </li>
              <li>
                <p>
                  <span className="underline">
                    CreativeProducer & Creative Director | Storytellers Studio
                    (2018 – 2019)
                  </span>
                  <br />
                  <span>
                    Розробляв top notch веб-серіали з інтегрованою історією
                    бренду.
                    <br />
                    Очолював команду з 60-80 людей, контролюючи концепцію та
                    продакшн.
                  </span>
                </p>
              </li>
              <li>
                <p>
                  <span className="underline ">
                    Creative Producer | 2+2 TV Channel (2017-2018)
                  </span>
                  <br />
                  <span>
                    Розробив серію документальних фільмів для проекту
                    «Загублений світ».
                  </span>
                </p>
              </li>
              <li>
                <p>
                  <span className="underline ">
                    Creative Director | 1+1 TV Channel (2014 – 2017)
                  </span>
                  <br />
                  <span>
                    Очолював команду з 7 чоловік у формуванні творчого бачення
                    1+1 Marketing.
                  </span>
                </p>
              </li>
              <li>
                <p>
                  <span className="underline ">
                    Creative Director | Film.Ua Production (2013)
                  </span>
                  <br />
                  <span>Розробляв художні серіали та докудрами.</span>
                </p>
              </li>
              <li>
                <p>
                  <span className="underline ">
                    Creative Director | Multiple Ad Agencies (including
                    international firms) (1996 – 2014)
                  </span>
                  <br />
                  <span>
                    Керував творчими колективами по 5-25 осіб. <br /> Створював
                    мультинаціональні рекламні кампанії для світових брендів
                  </span>
                </p>
              </li>
            </ul>

            <div className="text-center mt-8">
              <h4>ЧОМУ Я?</h4>
              <ul className="space-y-2">
                <li>
                  📚 Майстер сторітелінгу — глибока експертиза у створенні
                  наративного контенту
                </li>
                <li>
                  🎮 📺 📖 Досвід у різних індустріях — ігри, ТБ, книжки,
                  реклама
                </li>
                <li>
                  🏆 Підтверджене лідерство — керування командами до 80 осіб
                </li>
                <li>
                  🌍 Глобальне бачення — проєкти для аудиторій по всьому світу
                </li>
                <li>✨ Готовий давати історіям життя</li>
              </ul>
            </div>
          </div>
        </div>
      </section>
    </>
  );
}
